"------------------------------------------------------------------------------
" その他のキーバインドなど
"------------------------------------------------------------------------------

"--------------------------------------------------------
" ファイルを開いたときに自動的にcdする
"--------------------------------------------------------
" function! CdOnBufEnter()
" 	try
" 		lcd %:p:h
" 	catch
" 		" 握りつぶす
" 	endtry
" endfunction
" au BufEnter * execute "call CdOnBufEnter()"


"--------------------------------------------------------
" カレントバッファのファイルがあるディレクトリにcdする
"--------------------------------------------------------
function! CdToCurrentBufDir()
	try
		cd %:p:h
		pwd
	catch
		" 握りつぶす
	endtry
endfunction
command! Cd call CdToCurrentBufDir()


"--------------------------------------------------------
" ファイル保存時に末尾の余計なスペースを削除
"--------------------------------------------------------
" autocmd BufWritePre * :%s/\s\+$//ge


"--------------------------------------------------------
" クリップボードにコピー
"--------------------------------------------------------
" 選択部分をコピー
vnoremap <C-c><C-c> "+y
" 1文字
inoremap <C-c><C-c> v"+y
nnoremap <C-c><C-c> v"+y
" 単語
inoremap <C-c><C-i><C-y> viw"+y
nnoremap <C-c><C-i><C-y> viw"+y


